<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#HackerRank-SQL-Solutions,-using-Pandas-and-SQL" data-toc-modified-id="HackerRank-SQL-Solutions,-using-Pandas-and-SQL-1">HackerRank SQL Solutions, using Pandas and SQL</a></span><ul class="toc-item"><li><span><a href="#Higher-than-75-marks" data-toc-modified-id="Higher-than-75-marks-1.1">Higher than 75 marks</a></span><ul class="toc-item"><li><span><a href="#Pandas" data-toc-modified-id="Pandas-1.1.1">Pandas</a></span></li><li><span><a href="#SQL" data-toc-modified-id="SQL-1.1.2">SQL</a></span></li></ul></li><li><span><a href="#Employee-Names" data-toc-modified-id="Employee-Names-1.2">Employee Names</a></span><ul class="toc-item"><li><span><a href="#Pandas" data-toc-modified-id="Pandas-1.2.1">Pandas</a></span></li><li><span><a href="#SQL" data-toc-modified-id="SQL-1.2.2">SQL</a></span></li></ul></li><li><span><a href="#Employee-Salaries" data-toc-modified-id="Employee-Salaries-1.3">Employee Salaries</a></span><ul class="toc-item"><li><span><a href="#Pandas" data-toc-modified-id="Pandas-1.3.1">Pandas</a></span></li><li><span><a href="#SQL" data-toc-modified-id="SQL-1.3.2">SQL</a></span></li></ul></li><li><span><a href="#Type-of-Triangle" data-toc-modified-id="Type-of-Triangle-1.4">Type of Triangle</a></span><ul class="toc-item"><li><span><a href="#Pandas" data-toc-modified-id="Pandas-1.4.1">Pandas</a></span></li><li><span><a href="#SQL" data-toc-modified-id="SQL-1.4.2">SQL</a></span></li></ul></li><li><span><a href="#The-PADS" data-toc-modified-id="The-PADS-1.5">The PADS</a></span><ul class="toc-item"><li><span><a href="#Pandas" data-toc-modified-id="Pandas-1.5.1">Pandas</a></span></li><li><span><a href="#SQL" data-toc-modified-id="SQL-1.5.2">SQL</a></span></li></ul></li><li><span><a href="#Occupations" data-toc-modified-id="Occupations-1.6">Occupations</a></span><ul class="toc-item"><li><span><a href="#Pandas" data-toc-modified-id="Pandas-1.6.1">Pandas</a></span></li></ul></li><li><span><a href="#Binary-Tree-Node" data-toc-modified-id="Binary-Tree-Node-1.7">Binary Tree Node</a></span><ul class="toc-item"><li><span><a href="#Pandas" data-toc-modified-id="Pandas-1.7.1">Pandas</a></span></li></ul></li><li><span><a href="#New-Companies" data-toc-modified-id="New-Companies-1.8">New Companies</a></span><ul class="toc-item"><li><span><a href="#Pandas" data-toc-modified-id="Pandas-1.8.1">Pandas</a></span></li></ul></li><li><span><a href="#The-Blunder" data-toc-modified-id="The-Blunder-1.9">The Blunder</a></span><ul class="toc-item"><li><span><a href="#Pandas" data-toc-modified-id="Pandas-1.9.1">Pandas</a></span></li></ul></li><li><span><a href="#Top-Earners" data-toc-modified-id="Top-Earners-1.10">Top Earners</a></span><ul class="toc-item"><li><span><a href="#Pandas" data-toc-modified-id="Pandas-1.10.1">Pandas</a></span></li><li><span><a href="#SQL" data-toc-modified-id="SQL-1.10.2">SQL</a></span></li></ul></li></ul></li></ul></div>

# HackerRank SQL Solutions, using Pandas and SQL

## Higher than 75 marks
Question: Query the Name of any students in Students who scored higher than 75 marks. Order your output by the last three characters of each name. If two or more students both have names ending in the same last three characters such as Bobby, Robby, etc., secondary sort them by ascending ID.

### Pandas

In [1]:
# There are three conditions.
# condition 1: higher than 75 marks
# condition 2: order by the last three characters of each name
# condition 3: if the condition 2 is the same, secondary sort them by ID in ascending order
# , which means that smaller one comes first

import pandas as pd

students = pd.read_csv('Students.csv')
result = students[students['Marks'] > 75].reset_index(drop=True)

for i, name in enumerate(result['Name']):
    result.loc[i, 'LastThree'] = name[-3:]

result = result.sort_values(
    by=['LastThree', 'ID'], ascending=(True, True))['Name']
result

0    Ashley
1     Julia
2    Belvet
Name: Name, dtype: object

### SQL

In [2]:
# creating a database
import sqlite3
from pathlib import Path
Path('students.db').touch()

# connecting the database
conn = sqlite3.connect('students.db')
c = conn.cursor()

# creating a table in the database
c.execute('''DROP TABLE students''')
c.execute('''CREATE TABLE students (ID int, Name text, Marks int)''')

# write the data to a sqlite table
students.to_sql('students', conn, if_exists='replace', index=False)

# execute sql query
c.execute('''SELECT Name FROM students 
             WHERE Marks > 75 
             ORDER BY substr(Name, -3, 3) ASC, ID ASC''')
# substr function has three arguments: string, starting point, length I want
c.fetchall()

[('Ashley',), ('Julia',), ('Belvet',)]

## Employee Names

Question: Print a list of employee names from the Employee table in alphabetical order

### Pandas

In [4]:
import pandas as pd

employee = pd.read_csv('Employee.csv')
employee.sort_values(['name'])['name']

1      Angela
6      Bonnie
2       Frank
9         Joe
5    Kimberly
4        Lisa
7     Michael
3     Patrick
0        Rose
8        Todd
Name: name, dtype: object

### SQL

In [207]:
# creating a database
import sqlite3
from pathlib import Path
Path('employee.db').touch()

# connecting the database
conn = sqlite3.connect('employee.db')
c = conn.cursor()

# creating a table in the database
# c.execute('''DROP TABLE employee''')
c.execute(
    '''CREATE TABLE employee (employee_id int, name text, months int, salary int)''')

# write the data to a sqlite table
employee.to_sql('employee', conn, if_exists='replace', index=False)

# execute sql query
c.execute('''SELECT name FROM employee 
             ORDER BY name ASC''')
c.fetchall()

[('Angela',),
 ('Bonnie',),
 ('Frank',),
 ('Joe',),
 ('Kimberly',),
 ('Lisa',),
 ('Michael',),
 ('Patrick',),
 ('Rose',),
 ('Todd',)]

## Employee Salaries

Question: Print a list of employee names for employees in Employee having a salary greater than $ 2,000 per month who have been employeed for less than 10 months.

### Pandas

In [208]:
# Pandas# There are two conditions.
# Condition 1: a salary is greater than $ 2,000 per month.
# Condition 2: one has been employeed for less than 10 months.

import pandas as pd

employee = pd.read_csv('Employee.csv')
employee[(employee['salary'] > 2000) & (employee['months'] < 10)]['name']

1     Angela
7    Michael
8       Todd
9        Joe
Name: name, dtype: object

In [362]:
employee

   employee_id      name  months  salary
0        12228      Rose      15    1968
1        33645    Angela       1    3443
2        45692     Frank      17    1608
3        56118   Patrick       7    1345
4        59725      Lisa      11    2330
5        74197  Kimberly      16    4372
6        78454    Bonnie       8    1771
7        83565   Michael       6    2017
8        98607      Todd       5    3396
9        99989       Joe       9    3573

### SQL

In [211]:
# execute sql query
c.execute('''SELECT name FROM employee
             WHERE salary > 2000 and months < 10
             ORDER BY name ASC''')
c.fetchall()

[('Angela',), ('Joe',), ('Michael',), ('Todd',)]

## Type of Triangle

Question: Write a query indentifying the type of each record in the TRIANGLES table using its three side lengths. Output one of the following statements for each record in the table:
- Equilateral: it's a triangle with 3 sides of equal length
- Isosceles: it's a triangle with 2 sides of equal length
- Scalene: it's a triangle with 3 sides of differing lengths
- Not A Triangle: the given values of A, B, and C don't form a triangle

### Pandas

In [37]:
# Pandas# first, figure out whether each row forms a triangle, which means that
# if one of sides is longer than the sum of other two sides, that doesn't form a triangle.
# then, set the type of triangles

import pandas as pd

triangles = pd.read_csv('TRIANGLES.csv')
triangles['Type'] = ''

for i, row in triangles.iterrows():
    if row[0] > row[1] + row[2] or row[1] > row[2] + row[0] or row[2] > row[1] + row[0]:
        triangles.loc[i, 'Type'] = 'Not A Triangle'
    else:
        if row[0] == row[1] == row[2]:
            triangles.loc[i, 'Type'] = 'Equilateral'
        elif row[0] == row[1] or row[0] == row[2] or row[1] == row[2]:
            triangles.loc[i, 'Type'] = 'Isosceles'
        else:
            triangles.loc[i, 'Type'] = 'Scalene'

triangles['Type']

0         Isosceles
1       Equilateral
2           Scalene
3    Not A Triangle
Name: Type, dtype: object

### SQL

In [248]:
# creating a database
import sqlite3
from pathlib import Path
Path('triangle.db').touch()

# connecting the database
conn = sqlite3.connect('triangle.db')
c = conn.cursor()

# creating a table in the database
c.execute('''DROP TABLE triangle''')
c.execute('''CREATE TABLE triangle (A int, B int, C int)''')

# write the data to a sqlite table
triangles = pd.read_csv('TRIANGLES.csv')
triangles.to_sql('triangle', conn, if_exists='replace', index=False)

In [278]:
# execute sql query
# to see column names: c.execute('''PRAGMA table_info(triangle)''').fetchall()
c.execute('''SELECT 
             CASE WHEN A + B > C AND A + C > B AND B + C > A THEN 
                 CASE WHEN A = B AND B = C THEN 'Equilateral' 
                      WHEN A = B OR B = C OR A = C THEN 'Isosceles' 
                      WHEN A != B OR B != C OR A != C THEN 'Scalene' 
                      END ELSE 'Not A Triangle' END 
                      FROM triangle''')
c.fetchall()

[('Isosceles',), ('Equilateral',), ('Scalene',), ('Not A Triangle',)]

## The PADS
Question1: query an alphabetically ordered list of all names in Occupations, immediately followed by the first letter of each profession as a parenthetical (i.e.: enclosed in parentheses). For example: AnActorName(A), ADoctorName(D), AProfessorName(P), and ASingerName(S).

Question2: Query the number of occurences of each occupation in Occupations. Sort the occurences in ascending order, and output them in the following format: `There are a total of [occupation_count] [occupation]s.` [occupation] is the lowercase occupation name. If more than one occupation has the same [occupation_count], they should be ordered alphabetically.

### Pandas

In [342]:
# question 1

import pandas as pd

occupations = pd.read_csv('Occupations.csv')
occupations['Name_O'] = ''

for i, occupation in enumerate(occupations['Occupation']):
    if occupation == 'Doctor':
        occupations.loc[i, 'Name_O'] = occupations.loc[i, 'Name'] + '(D)'
    elif occupation == 'Actor':
        occupations.loc[i, 'Name_O'] = occupations.loc[i, 'Name'] + '(A)'
    elif occupation == 'Singer':
        occupations.loc[i, 'Name_O'] = occupations.loc[i, 'Name'] + '(S)'
    else:
        occupations.loc[i, 'Name_O'] = occupations.loc[i, 'Name'] + '(P)'


result1 = occupations.sort_values('Name')['Name_O']
result1

4       Ashely(P)
6    Christeen(P)
7         Jane(A)
8        Jenny(D)
1        Julia(A)
5        Ketty(P)
2        Maria(A)
3        Meera(S)
9        Priya(S)
0     Samantha(D)
Name: Name_O, dtype: object

In [343]:
# Question 2
occupations.drop(columns='Name_O', inplace=True)

result2 = occupations.groupby('Occupation').agg('count')
result2 = result2.sort_values(['Name', 'Occupation']).reset_index()
result2['Explanation'] = ''

for i, occupation in enumerate(result2['Occupation']):
    result2.loc[i, 'Explanation'] = ('There are a total of ' + str(result2.loc[i, 'Name'])
                                     + ' ' + result2.loc[i, 'Occupation'].lower() + 's.')
result2 = result2['Explanation']
result2

0       There are a total of 2 doctors.
1       There are a total of 2 singers.
2        There are a total of 3 actors.
3    There are a total of 3 professors.
Name: Explanation, dtype: object

### SQL

In [341]:
# creating a database
import sqlite3
from pathlib import Path
Path('occupation.db').touch()

# connecting the database
conn = sqlite3.connect('occupation.db')
c = conn.cursor()

# creating a table in the database
# c.execute('''DROP TABLE occupation''')
c.execute('''CREATE TABLE occupation (Name text, Occupation text)''')

# write the data to a sqlite table
occupations = pd.read_csv('Occupations.csv')
occupations.to_sql('occupation', conn, if_exists='replace', index=False)

In [348]:
# question 1
# execute sql query
# to see column names: c.execute('''PRAGMA table_info(triangle)''').fetchall()
c.execute('''SELECT (Name||'('||substr(Occupation, 1, 1)||')') FROM occupation
             ORDER BY Name''')
c.fetchall()

[('Ashely(P)',),
 ('Christeen(P)',),
 ('Jane(A)',),
 ('Jenny(D)',),
 ('Julia(A)',),
 ('Ketty(P)',),
 ('Maria(A)',),
 ('Meera(S)',),
 ('Priya(S)',),
 ('Samantha(D)',)]

In [353]:
# question 2
c.execute('''SELECT ('There are a total of '||COUNT(occupation)||' '||lower(occupation)||'s.') AS total 
             FROM occupation
             GROUP BY occupation
             ORDER BY total ''')
c.fetchall()

[('There are a total of 2 doctors.',),
 ('There are a total of 2 singers.',),
 ('There are a total of 3 actors.',),
 ('There are a total of 3 professors.',)]

## Occupations
Question: Pivot the Occupation column in OCCUPATIONS so that each Name is sorted alphabetically and displayed underneath its corresponding Occupation. The output column headers should be Doctor, Professor, Singer, and Actor, respectively.

### Pandas

In [160]:
import pandas as pd

df = pd.read_csv('Occupations.csv')
groups = df.groupby('Occupation')['Name'].apply(list).reset_index()
result = groups.T
new_header = result.iloc[0]
result = result[1:]
result.columns = new_header
result = result[['Doctor', 'Professor', 'Singer', 'Actor']]
result
# groups = df.groupby('Occupation').agg(lambda x: list(x))
# groups
# for name, group in groups:
#     print(name)
#     print(group)

Occupation,Doctor,Professor,Singer,Actor
Name,"[Samantha, Jenny]","[Ashely, Ketty, Christeen]","[Meera, Priya]","[Julia, Maria, Jane]"

## Binary Tree Node
Question: Write a query to find the node type of Binary Tree ordered by the value of the node. Output one of the following for each node:

- Root: If node is root node.
- Leaf: If node is leaf node.
- Inner: If node is neither root nor leaf node.
### Pandas

In [336]:
import pandas as pd

df = pd.read_csv('BST.csv')
df['NodeType'] = ""
for i, node in enumerate(df['N']):
    if pd.isna(df.loc[i, 'P']):
        df.loc[i, 'NodeType'] = 'Root'
    else:
        if node in df['P'].values:
            df.loc[i, 'NodeType'] = 'Inner'
        if not node in df['P'].values:
            df.loc[i, 'NodeType'] = 'Leaf'

df.sort_values('N').style.hide_columns('P').hide_index()

## New Companies
Question: Amber's conglomerate corporation just acquired some new companies. Each of the companies follows this hierarchy: Founder, Lead Manager, Senior Manager, Manager, Employee

Write a query to print the company_code, founder name, total number of lead managers, total number of senior managers, total number of managers, and totoal number of employees. Order your output by ascending company_code.
### Pandas

In [383]:
import pandas as pd

company = pd.read_csv('Company.csv')
lead_manager = pd.read_csv('Lead_Manager.csv')
senior_manager = pd.read_csv('Senior_Manager.csv')
manager = pd.read_csv('Manager.csv')
employee = pd.read_csv('Employee2.csv')

# count the number of positions in each table
lead_manager_count = lead_manager.groupby('company_code').agg('count')
senior_manager_count = senior_manager.groupby(
    'company_code')['senior_manager_code'].agg('count')
manager_count = manager.groupby('company_code')['manager_code'].agg('count')
employee_count = employee.groupby('company_code')['employee_code'].agg('count')

# merge the counts with company table
result = company.merge(lead_manager_count, on='company_code').merge(senior_manager_count,
                                                                    on='company_code').merge(manager_count, on='company_code').merge(employee_count, on='company_code')
result.columns = ['company_code', 'founder', 'lead_manager_count', 'senior_manager_count',
                  'manager_count', 'employee_count']
result

,company_code,founder,lead_manager_count,senior_manager_count,manager_count,employee_count
0,C1,Monika,1,2,1,2
1,C2,Samantha,1,1,2,2

## The Blunder
Question: Given that keyboard's 0 key was broken, write a query calculating the amount of error, which is actual - miscalculated average monthly salary and round it up to the next integer.
### Pandas

In [1]:
import pandas as pd

employee = pd.read_csv('EMPLOYEES.csv')
employee

mis_total = 0
total = 0
for i, salary in enumerate(employee['Salary']):
    # convert int to str, replace 0 to '', and convert str to int
    mis_total += int(str(salary).replace('0', ''))
    total += salary
diff = (total - mis_total)/len(employee)
diff

2061.0

## Top Earners
Question: An employee's total earning is their monthly salary * months. Write a quety to find the maximum total earnings for all employees as well as the total number of employees who have maximum total earnings. Then print these values as 2 space-separated integers.

### Pandas

In [10]:
import pandas as pd

employee = pd.read_csv('Employee.csv')
employee['total_earnings'] = employee['months']*employee['salary']
print(max(employee['total_earnings']), '  ',
      employee[employee['total_earnings'] == max(employee['total_earnings'])]['total_earnings'].agg('count'))

69952    1

### SQL

In [24]:
# creating a database
import sqlite3
from pathlib import Path
Path('employee.db').touch()

# connecting the database
conn = sqlite3.connect('employee.db')
c = conn.cursor()

# creating a table in the database
c.execute('''DROP TABLE employee''')
c.execute(
    '''CREATE TABLE employee (employee_id int, name text, months int, salary int)''')

# write the data to a sqlite table
employee = pd.read_csv('Employee.csv')
employee.to_sql('employee', conn, if_exists='replace', index=False)

In [25]:
c.execute('''SELECT MAX(months * salary) ||'  '|| COUNT(*) FROM employee 
             GROUP BY salary 
             HAVING MAX(months * salary) = (SELECT MAX(months * salary) FROM employee)''')
c.fetchall()

[('69952  1',)]